Hi @aneeshk-citrix,

I have been testing the provider version 1.0.34, and policy management still seems very inconsistent.

First attempt  of creating new policy:
TF plan:
```
Terraform will perform the following actions:

  # module.citrix_policies.citrix_policy_priority.default will be updated in-place
  ~ resource "citrix_policy_priority" "default" {
      ~ policy_names    = [
          - "Log-off policy",
          - "Default Policy - Data loss prevention",
          - "Default Policy - Disable HDX adaptive transport",
          - "Default Policy - Fallback User Log-off timers",
        ] -> (known after apply)
      ~ policy_priority = [
          + (known after apply),
            "c47948c4-8504-4d89-8d77-6c47b9a2c68b",
            # (3 unchanged elements hidden)
        ]
      ~ policy_set_name = "REDACTED (DEV) - Policy set" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default will be created
  + resource "citrix_policy" "default" {
      + description   = "Setting Victual Channel allow list for DVC"
      + enabled       = false
      + id            = (known after apply)
      + name          = "Virtual Channel DVC"
      + policy_set_id = "a7223223-e27a-4bd7-8d0b-16960d55a61e"
    }

  # module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy_setting.default["DynamicVirtualChannelAllowList"] will be created
  + resource "citrix_policy_setting" "default" {
      + id          = (known after apply)
      + name        = "DynamicVirtualChannelAllowList"
      + policy_id   = (known after apply)
      + use_default = false
      + value       = jsonencode(
            [
              + "C:\\Program Files (x86)\\Power Automate agent for virtual desktops\\PAD.RDP.ControlAgent.exe,Microsoft.Flow.RPA.Desktop.UIAutomation.RDP.DVC.Plugin,PAD\\CONTROL",
            ]
        )
    }

``` 
TF apply::
```
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default: Creating...
╷
│ Error: Error reading Policy 428bf0fc-85bc-4c3c-a457-52b58b492868
│ 
│   with module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default,
│   on modules/citrix-policies/policy/main.tf line 8, in resource "citrix_policy" "default":
│    8: resource "citrix_policy" "default" {
│ 
│ TransactionId: 556e4c0e-d5c0-4158-9e00-fa1460f97432
│ Error message: 404 Not Found  (Policy
│ '428bf0fc-85bc-4c3c-a457-52b58b492868' does not exist.)
``` 
Apply fails, however policy has been created and visible in Citrix Cloud.

Rerun TF plan:
```
Terraform will perform the following actions:

  # module.citrix_policies.citrix_policy_priority.default will be updated in-place
  ~ resource "citrix_policy_priority" "default" {
      ~ policy_names    = [
          - "Log-off policy",
          - "Default Policy - Data loss prevention",
          - "Default Policy - Disable HDX adaptive transport",
          - "Default Policy - Fallback User Log-off timers",
          - "Virtual Channel DVC",
        ] -> (known after apply)
      ~ policy_priority = [
          ~ "c47948c4-8504-4d89-8d77-6c47b9a2c68b" -> (known after apply),
          ~ "dd17c11e-edf2-49f9-b5e1-4e12033c26be" -> "c47948c4-8504-4d89-8d77-6c47b9a2c68b",
          ~ "b571eb45-4253-4f44-9985-7029c022fce8" -> "dd17c11e-edf2-49f9-b5e1-4e12033c26be",
          ~ "b1fd101c-42e7-4a2f-9c54-200e41417dec" -> "b571eb45-4253-4f44-9985-7029c022fce8",
          ~ "428bf0fc-85bc-4c3c-a457-52b58b492868" -> "b1fd101c-42e7-4a2f-9c54-200e41417dec",
        ]
      ~ policy_set_name = "REDACTED (DEV) - Policy set" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default will be created
  + resource "citrix_policy" "default" {
      + description   = "Setting Victual Channel allow list for DVC"
      + enabled       = false
      + id            = (known after apply)
      + name          = "Virtual Channel DVC"
      + policy_set_id = "a7223223-e27a-4bd7-8d0b-16960d55a61e"
    }

``` 
TF apply:
```
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default: Creating...
╷
│ Error: Error creating Policy Virtual Channel DVC
│ 
│   with module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default,
│   on modules/citrix-policies/policy/main.tf line 8, in resource "citrix_policy" "default":
│    8: resource "citrix_policy" "default" {
│ 
│ TransactionId: c3d90d1e-fc5c-46aa-be83-7c534508d2c2
│ Error message: 409 Conflict  (Virtual Channel DVC already exists.)
``` 
Fails again due to policy already created.

Removing policy TF plan:
```
Terraform will perform the following actions:

  # module.citrix_policies.citrix_policy_priority.default will be updated in-place
  ~ resource "citrix_policy_priority" "default" {
      ~ policy_names    = [
          - "Log-off policy",
          - "Default Policy - Data loss prevention",
          - "Default Policy - Disable HDX adaptive transport",
          - "Default Policy - Fallback User Log-off timers",
          - "Virtual Channel DVC",
        ] -> (known after apply)
      ~ policy_priority = [
            # (3 unchanged elements hidden)
            "b1fd101c-42e7-4a2f-9c54-200e41417dec",
          - "428bf0fc-85bc-4c3c-a457-52b58b492868",
        ]
      ~ policy_set_name = "REDACTED (DEV) - Policy set" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

Removing policy TF apply:
```
module.citrix_policies.citrix_policy_priority.default: Modifying...
╷
│ Error: Error managing Policy Priority in Policy Set a7223223-e27a-4bd7-8d0b-16960d55a61e
│ 
│   with module.citrix_policies.citrix_policy_priority.default,
│   on modules/citrix-policies/main.tf line 39, in resource "citrix_policy_priority" "default":
│   39: resource "citrix_policy_priority" "default" {
│ 
│ policy IDs [428bf0fc-85bc-4c3c-a457-52b58b492868] in the policy set are not
│ found in the `policy_priority` list
```
Removal failed. Had to remove the policy manually from Citrix Cloud.

Creating policy now works via TF

TF plan:

```
  # module.citrix_policies.citrix_policy_priority.default will be updated in-place
  ~ resource "citrix_policy_priority" "default" {
      ~ policy_names    = [
          - "Log-off policy",
          - "Default Policy - Data loss prevention",
          - "Default Policy - Disable HDX adaptive transport",
          - "Default Policy - Fallback User Log-off timers",
        ] -> (known after apply)
      ~ policy_priority = [
          + (known after apply),
            "c47948c4-8504-4d89-8d77-6c47b9a2c68b",
            # (3 unchanged elements hidden)
        ]
      ~ policy_set_name = "REDACTED 
(DEV) - Policy set" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default will be created
  + resource "citrix_policy" "default" {
      + description   = "Setting Victual Channel allow list for DVC"
      + enabled       = false
      + id            = (known after apply)
      + name          = "Virtual Channel DVC"
      + policy_set_id = "a7223223-e27a-4bd7-8d0b-16960d55a61e"
    }

  # module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy_setting.default["DynamicVirtualChannelAllowList"] will be created
  + resource "citrix_policy_setting" "default" {
      + id          = (known after apply)
      + name        = "DynamicVirtualChannelAllowList"
      + policy_id   = (known after apply)
      + use_default = false
      + value       = jsonencode(
            [
              + "C:\\Program Files (x86)\\Power Automate agent for virtual desktops\\PAD.RDP.ControlAgent.exe,Microsoft.Flow.RPA.Desktop.UIAutomation.RDP.DVC.Plugin,PAD\\CONTROL",
            ]
        )
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
TF apply:
```
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default: Creating...
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default: Creation complete after 2s [id=47ee2826-b983-431e-bf71-19dee6776d21]
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy_setting.default["DynamicVirtualChannelAllowList"]: Creating...
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy_setting.default["DynamicVirtualChannelAllowList"]: Creation complete after 1s [id=0e1565d8-dcd6-4969-97a4-edbe725f9dea]
module.citrix_policies.citrix_policy_priority.default: Modifying...
module.citrix_policies.citrix_policy_priority.default: Modifications complete after 0s
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.
``` 
Trying to delete policy via TF

TF plan:
```
Terraform will perform the following actions:

  # module.citrix_policies.citrix_policy_priority.default will be updated in-place
  ~ resource "citrix_policy_priority" "default" {
      ~ policy_names    = [
          - "Virtual Channel DVC",
          - "Log-off policy",
          - "Default Policy - Data loss prevention",
          - "Default Policy - Disable HDX adaptive transport",
          - "Default Policy - Fallback User Log-off timers",
        ] -> (known after apply)
      ~ policy_priority = [
          - "47ee2826-b983-431e-bf71-19dee6776d21",
            "c47948c4-8504-4d89-8d77-6c47b9a2c68b",
            # (3 unchanged elements hidden)
        ]
      ~ policy_set_name = "REDACTED(DEV) - Policy set" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default will be destroyed
  # (because module.citrix_policies.module.policy["Virtual Channel DVC"] is not in configuration)
  - resource "citrix_policy" "default" {
      - description   = "Setting Victual Channel allow list for DVC" -> null
      - enabled       = false -> null
      - id            = "47ee2826-b983-431e-bf71-19dee6776d21" -> null
      - name          = "Virtual Channel DVC" -> null
      - policy_set_id = "a7223223-e27a-4bd7-8d0b-16960d55a61e" -> null
    }

  # module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy_setting.default["DynamicVirtualChannelAllowList"] will be destroyed
  # (because module.citrix_policies.module.policy["Virtual Channel DVC"] is not in configuration)
  - resource "citrix_policy_setting" "default" {
      - id          = "0e1565d8-dcd6-4969-97a4-edbe725f9dea" -> null
      - name        = "DynamicVirtualChannelAllowList" -> null
      - policy_id   = "47ee2826-b983-431e-bf71-19dee6776d21" -> null
      - use_default = false -> null
      - value       = jsonencode(
            [
              - "C:\\Program Files (x86)\\Power Automate agent for virtual desktops\\PAD.RDP.ControlAgent.exe,Microsoft.Flow.RPA.Desktop.UIAutomation.RDP.DVC.Plugin,PAD\\CONTROL",
            ]
        ) -> null
    }

```
TF apply:
``` 
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy_setting.default["DynamicVirtualChannelAllowList"]: Destroying... [id=0e1565d8-dcd6-4969-97a4-edbe725f9dea]
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy_setting.default["DynamicVirtualChannelAllowList"]: Destruction complete after 1s
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default: Destroying... [id=47ee2826-b983-431e-bf71-19dee6776d21]
╷
│ Error: Error Deleting Policy 47ee2826-b983-431e-bf71-19dee6776d21
│ 
│ Policy has 1 settings attached to it. Please delete the settings first.
```
Rerun works

TF plan:
```
Terraform will perform the following actions:

  # module.citrix_policies.citrix_policy_priority.default will be updated in-place
  ~ resource "citrix_policy_priority" "default" {
      ~ policy_names    = [
          - "Virtual Channel DVC",
          - "Log-off policy",
          - "Default Policy - Data loss prevention",
          - "Default Policy - Disable HDX adaptive transport",
          - "Default Policy - Fallback User Log-off timers",
        ] -> (known after apply)
      ~ policy_priority = [
          - "47ee2826-b983-431e-bf71-19dee6776d21",
            "c47948c4-8504-4d89-8d77-6c47b9a2c68b",
            # (3 unchanged elements hidden)
        ]
      ~ policy_set_name = "REDACTED (DEV) - Policy set" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default will be destroyed
  # (because module.citrix_policies.module.policy["Virtual Channel DVC"] is not in configuration)
  - resource "citrix_policy" "default" {
      - description   = "Setting Victual Channel allow list for DVC" -> null
      - enabled       = false -> null
      - id            = "47ee2826-b983-431e-bf71-19dee6776d21" -> null
      - name          = "Virtual Channel DVC" -> null
      - policy_set_id = "a7223223-e27a-4bd7-8d0b-16960d55a61e" -> null
    }

Plan: 0 to add, 1 to change, 1 to destroy.
```

TF apply:
```
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default: Destroying... [id=47ee2826-b983-431e-bf71-19dee6776d21]
module.citrix_policies.module.policy["Virtual Channel DVC"].citrix_policy.default: Destruction complete after 0s
module.citrix_policies.citrix_policy_priority.default: Modifying...
module.citrix_policies.citrix_policy_priority.default: Modifications complete after 2s
Releasing state lock. This may take a few moments...

Apply complete! Resources: 0 added, 1 changed, 1 destroyed.
``` 
